Repository: stfalcon-studio/uaroads_ios
Catalog: UARoads_swift/UARoads_swift/Resorces/*.lproj/Localizable.strings
Languages: ru, uk

# tabbar.item.0
source: Build route
ru: Маршруты
uk: Маршрути

# tabbar.item.1
source: Record
ru: Запись
uk: Запис

# tabbar.item.2
source: Tracks
ru: Треки
uk: Треки

# tabbar.item.3
source: Settings
ru: Настройки
uk: Параметри

# TutorialVC.continueButtonTitle
source: continue
ru: продолжить
uk: продовжити

# TutorialVC.firstTitleLabel
source: Build routes
ru: Построение маршрута
uk: Прокладання маршруту

# TutorialVC.firstDescriptionLabel
source: Build routes through the best Ukrainian roads in view of road quality.
ru: Прокладывайте маршруты только лучшими дорогами Украины с учетом качества дорожного покрытия.
uk: Прокладайте маршрути лише кращими дорогами України з урахуванням якості дорожного покриття.

# TutorialVC.secondTitleLabel
source: Collect statistics
ru: Сбор статистики
uk: Збір статистики

# TutorialVC.secondDescrLabel
source: Collect road quality statistics with help of autimatic pit fixation.
ru: Собирайте статистику о состоянии дорогс помощью автоматической фиксации ям.
uk: Збирайте статистику про стан доріг за допомогою автоматичної фіксації ям.

# RoutesVC.title
source: Build route
ru: Построение маршрута
uk: Побудова маршруту

# RoutesVC.fromTextFieldPlaceholder
source: from
ru: Откуда
uk: Звідки

# RoutesVC.toTextFieldPlaceholder
source: to
ru: Куда
uk: Куди

# RoutesVC.buildButtonTitle
source: Build
ru: Построить
uk: Побудувати

# RoutesVC.myCurrentLocation
source: My current location
ru: Моя текущая позиция
uk: Моє поточне місце розташування

# RoutesVC.goToLocationSetting
source: Geolocation is turned off. Would you like to open the settings to enable geolocation?
ru: Геолокация выключена. Открыть настройки, чтобы включить геолокацию?
uk: Геолокацію вимкнено. Бажаєте відкрити Параметри, щоб увімкнути геолокацію?

# RouteBuidVC.cancelButtonTitle
source: Cancel
ru: Отмена
uk: Скасувати

# RouteBuidVC.title
source: Route
ru: Маршрут
uk: Маршрут

# RouteBuidVC.goButtonTitle
source: GO!
ru: Поехали!
uk: Поїхали!

# RouteBuidVC.fromLabel
source: from
ru: откуда
uk: звідки

# RouteBuidVC.toLabel
source: to
ru: куда
uk: куди

# RecordTrackVC.title
source: Record
ru: Запись
uk: Запис

# RecordTrackVC.lastTrackLabel
source: Last track
ru: Последняя поездка
uk: Остання поїздка

# RecordTrackVC.totalDistLabel
source: Total tracks distance on server
ru: Дистанция, обработанная на сервере
uk: Дистанція, оброблена на сервері

# RecordTrackVC.startButtonTitle
source: Start Tracking
ru: Начало Записи
uk: Почати запис

# RecordTrackVC.pauseButtonTitle
source: Pause
ru: Пауза
uk: Пауза

# RecordTrackVC.pauseButtonTitleSelected
source: Continue
ru: Продолжить
uk: Продовжити

# RecordTrackVC.stopButtonTitle
source: Stop
ru: Стоп
uk: Зупинити

# RecordTrackVC.currTrackView.title
source: Current track
ru: Текущая поездка
uk: Поточний сеанс

# RecordTrackVC.sendDistanceToServer
source: Processed distance on server
ru: Обработанное расстояние на сервере
uk: Опрацьована дистанція на сервері

# RecordTrackVC.startRecordWithoutLocation
source: To start recording, turn on Location Services in Settings
ru: Для начала записи включите службу геолокации в настройках
uk: Для початку запису увімкніть службу геолокації в параметрах

# RecordTrackVC.startRecordWithoutLocationAuto
source: The application can not start automatic recording because the geolocation service is turned off. You can turn on the geolocation service in the settings
ru: Невозможно автоматически начать запись, так как выключены службы геолокации. Вы можете включить их в настройках
uk: Неможливо автоматично почати запис, тому що вимкнені служби геолокації. Ви можете ввімнути їх у параметрах

# TracksVC.title
source: Recorded tracks
ru: Записанные треки
uk: Записані треки

# TracksVC.emptyDataSet.buttonTitle
source: Start
ru: Начать
uk: Почати

# TracksVC.emptyDataSet.title
source: You have no tracks yet
ru: Вы не записали ни одного маршрута
uk: Ви не записали ще жодного маршруту

# TrackStatus.active
source: Active
ru: Построение маршрута
uk: Запис маршруту

# TrackStatus.saved
source: Saved
ru: Сохранено
uk: Відправлено

# TrackStatus.waitingForUpload
source: Waiting For Upload
ru: Ожидает отправки
uk: Очікує на відправку

# TrackStatus.uploading
source: Uploading
ru: Отправляется
uk: Відправляється

# TrackStatus.uploaded
source: Uploaded
ru: Отправлено
uk: Відправлено

# SettingsVC.title
source: Settings
ru: Параметры
uk: Параметри

# SettingsVC.signInHeaderTitle
source: user
ru: пользователь
uk: користувач

# SettingsVC.emailTextField.placeholder
source: Enter email
ru: введите email
uk: Введіть email

# SettingsVC.signInFooter.signInButtonTitle
source: Sign In
ru: Войти
uk: Увійти

# SettingsVC.signOutButtonTitle
source: Sign Out
ru: Выход
uk: Вихід

# SettingsVC.signInFooter.labelText
source: Authorized users can view their site statistics, get in TOP, gain reward for their achievements.
ru: Авторизированные пользователи могут просматривать свою статистику на сайте, учавствовать в рейтинге: получать награды за свои достижения.
uk: Авторизовані користувачі мають змогу переглядати свою статистику на сайті, брати участь у рейтингу, отримувати нагороди за свої досягнення.

# SettingsVC.cellTitle.sendDataOnlyViaWiFi
source: Send data only via WiFi
ru: Отправлять данные только с помощью WiFi
uk: Відправляти дані тільки по WiFi

# SettingsVC.cellTitle.sendTracksAutomatically
source: Send tracks automatically
ru: Отправлять треки автоматически
uk: Відправляти записи автоматично

# SettingsVC.cellTitle.autostartRecordRoutes
source: Route recording autostart
ru: Автоматическая запись
uk: Автоматичний запис

# SettingsVC.switchFooter.versionLabel
source: Version:
ru: Версия приложения:
uk: Версія додатку:

# SettingsVC.enableActivityAlert
source: Need enable activity tracker in Settings
ru: Нужно включить отслежевание активности в настройках
uk: Необхідно ввімкнути відслідковування активності в парамтрах

source: km
ru: км
uk: км

source: Settings
ru: Настройки
uk: Параметри

source: Cancel
ru: Отмена
uk: Скасувати

source: Warning
ru: Предупреждение
uk: Попередження

source: Error
ru: Ошибка
uk: Помилка

# Alert.cannotFindRoute
source: Cannot find route between points
ru: Невозможно построить маршрут между пунктами
uk: Неможливо побудувати маршрут між пунктами

# Alert.serverConnectionError
source: Server connection error
ru: Ошибка подключения к серверу
uk: Помилка підключення до серверу

# Alert.checkEmail
source: Check your email
ru: Проверьте свой email
uk: Перевірте свій email

# Alert.deviceRegisterError
source: Device Registration error!
ru: Ошибка регистарции устройства!
uk: Помилка реєстрації пристрою!

# Alert.enableBackgroundLocation
source: You need to enable background location updates
ru: Нужно включить обновления локации в фоновом режиме
uk: Потрібно ввімкнути оновлення геопозиції у фоновому режимі

# Alert.enableBackgroundLocationTitle
source: Background Refresh Disabled
ru: Фоновые обновления выключены
uk: Фонові оновлення вимкнені

# Alert.autostart
source: Autostart isn't enable on your device
ru: Автоматическая запись не может быть включена для вашего устройства
uk: Автоматичний запис не може бути ввімкнений для вашого пристрою

# Alert.uidCopied
source: Uid is copied to clipboard
ru: Uid скопирован
uk: Uid скопійовано

# Alert.minDistanceRoute
source: Route distance - %d. You can not build the route between locations where distance is less %d meters.
ru: Расстояние маршрута - %d. Вы не можете построить маршрут между пунктами, если расстояние меньше %d метров.
uk: Відстань маршрута - %d. Ви не можете побудувати маршрут між пунктами, якщо відстань менша %d метрів.

# Notification.locationServiceDisabled
source: Record not started because location is disabled
ru: Автоматическая запись не начнеться, потому что служба геолокации выключена
uk: Автоматичний запис не почнеться, тому що служба геолокації вимкнена

# TrackStateActive
source: Active
ru: Активен
uk: Активний

# TrackStateSaved
source: Saved
ru: Сохранен
uk: Збережено

# TrackStateWait
source: Waiting For Upload
ru: Ожидание загрузки
uk: Чекає на відправлення

# TrackStateUploading
source: Uploading
ru: Загружается
uk: Відправлення

# TrackStateUploaded
source: Uploaded
ru: Загружен
uk: Відправлено

# ShortCut.item.1.forStart
source: Start record
ru: Начать запись
uk: Почати запис

# ShortCut.item.1.forPause
source: Stop record
ru: Остановить запись
uk: Зупинити запис

# ShortCut.item.2
source: Tracks
ru: Поездки
uk: Поїздки

# ShortCut.item.3
source: Settings
ru: Настройки
uk: Параметри
